
## Terraform plan for environment: `dev`

**Commit:** 2ba2cd556c8059748174bedb2533890394a048da


**API version:** c5ba4e9
**Selfserve version:** c5ba4e9
**Internal version:** c5ba4e9

### Plan summary

`2 to add, 3 to change, 5 to destroy`

**🆕 Creates**

```tf
module.service.module.batch.aws_batch_job_queue.this["default"]
module.service.module.batch.aws_batch_scheduling_policy.this["default"]
```
**🗑️ Deletes**

```tf
module.service.module.batch.aws_batch_job_definition.this["process-queue"]
module.service.module.batch.aws_batch_job_queue.this["high_priority"]
module.service.module.batch.aws_batch_job_queue.this["low_priority"]
module.service.module.batch.aws_batch_scheduling_policy.this["high_priority"]
module.service.module.batch.aws_batch_scheduling_policy.this["low_priority"]
```
**🔄 Updates**

```tf
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.service.module.cloudfront.aws_cloudfront_distribution.this[0] has changed
  ~ resource "aws_cloudfront_distribution" "this" {
        id                              = "E3R9S2AKJG4ZTR"
      ~ status                          = "InProgress" -> "Deployed"
        tags                            = {}
        # (21 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_job_definition.this["process-queue"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/process-queue:1" -> (known after apply)
      ~ arn_prefix                 = "arn:aws:batch:eu-west-1:054614622558:job-definition/process-queue" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  + {
                      + name  = "ENVIRONMENT_NAME"
                      + value = "dev"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "c5ba4e9"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:latest" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:c5ba4e9"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              + runtimePlatform              = {
                  + cpu_architecture        = "ARM64"
                  + operating_system_family = "LINUX"
                }
              - secrets                      = []
              - ulimits                      = []
              - volumes                      = []
                # (4 unchanged attributes hidden)
            }
        )
      ~ id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/process-queue:1" -> (known after apply)
      ~ name                       = "process-queue" -> "vol-app-dev-process-queue" # forces replacement
      - parameters                 = {} -> null
      ~ revision                   = 1 -> (known after apply)
      - scheduling_priority        = 0 -> null
      - tags                       = {} -> null
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_queue.this["default"] will be created
  + resource "aws_batch_job_queue" "this" {
      + arn                   = (known after apply)
      + compute_environments  = [
          + "arn:aws:batch:eu-west-1:054614622558:compute-environment/vol-app-dev-fargate-20240712144932732600000006",
        ]
      + id                    = (known after apply)
      + name                  = "vol-app-dev-default"
      + priority              = 1
      + scheduling_policy_arn = (known after apply)
      + state                 = "ENABLED"
      + tags                  = {}
      + tags_all              = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["high_priority"] will be destroyed
  # (because key ["high_priority"] is not in for_each map)
  - resource "aws_batch_job_queue" "this" {
      - arn                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/BatchTestHighPriorityFargate" -> null
      - compute_environments  = [
          - "arn:aws:batch:eu-west-1:054614622558:compute-environment/vol-app-dev-fargate-20240712144932732600000006",
        ] -> null
      - id                    = "arn:aws:batch:eu-west-1:054614622558:job-queue/BatchTestHighPriorityFargate" -> null
      - name                  = "BatchTestHighPriorityFargate" -> null
      - priority              = 99 -> null
      - scheduling_policy_arn = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestHighPriorityFargate" -> null
      - state                 = "ENABLED" -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
    }

  # module.service.module.batch.aws_batch_job_queue.this["low_priority"] will be destroyed
  # (because key ["low_priority"] is not in for_each map)
  - resource "aws_batch_job_queue" "this" {
      - arn                   = "arn:aws:batch:eu-west-1:054614622558:job-queue/BatchTestLowPriorityFargate" -> null
      - compute_environments  = [
          - "arn:aws:batch:eu-west-1:054614622558:compute-environment/vol-app-dev-fargate-20240712144932732600000006",
        ] -> null
      - id                    = "arn:aws:batch:eu-west-1:054614622558:job-queue/BatchTestLowPriorityFargate" -> null
      - name                  = "BatchTestLowPriorityFargate" -> null
      - priority              = 1 -> null
      - scheduling_policy_arn = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestLowPriorityFargate" -> null
      - state                 = "ENABLED" -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
    }

  # module.service.module.batch.aws_batch_scheduling_policy.this["default"] will be created
  + resource "aws_batch_scheduling_policy" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "vol-app-dev-default"
      + tags_all = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + fair_share_policy {}
    }

  # module.service.module.batch.aws_batch_scheduling_policy.this["high_priority"] will be destroyed
  # (because key ["high_priority"] is not in for_each map)
  - resource "aws_batch_scheduling_policy" "this" {
      - arn      = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestHighPriorityFargate" -> null
      - id       = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestHighPriorityFargate" -> null
      - name     = "BatchTestHighPriorityFargate" -> null
      - tags     = {} -> null
      - tags_all = {
          - "Environment" = "dev"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null

      - fair_share_policy {
          - compute_reservation = 1 -> null
          - share_decay_seconds = 3600 -> null

          - share_distribution {
              - share_identifier = "A1*" -> null
              - weight_factor    = 0.1 -> null
            }
          - share_distribution {
              - share_identifier = "A2" -> null
              - weight_factor    = 0.2 -> null
            }
        }
    }

  # module.service.module.batch.aws_batch_scheduling_policy.this["low_priority"] will be destroyed
  # (because key ["low_priority"] is not in for_each map)
  - resource "aws_batch_scheduling_policy" "this" {
      - arn      = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestLowPriorityFargate" -> null
      - id       = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestLowPriorityFargate" -> null
      - name     = "BatchTestLowPriorityFargate" -> null
      - tags     = {} -> null
      - tags_all = {
          - "Environment" = "dev"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null

      - fair_share_policy {
          - compute_reservation = 0 -> null
          - share_decay_seconds = 0 -> null
        }
    }

  # module.service.module.ecs_service["api"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:054614622558:service/vol-app-dev-api-cluster/vol-app-dev-api-service"
        name                               = "vol-app-dev-api-service"
        tags                               = {}
      ~ wait_for_steady_state              = false -> true
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["internal"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:054614622558:service/vol-app-dev-internal-cluster/vol-app-dev-internal-service"
        name                               = "vol-app-dev-internal-service"
        tags                               = {}
      ~ wait_for_steady_state              = false -> true
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:054614622558:service/vol-app-dev-selfserve-cluster/vol-app-dev-selfserve-service"
        name                               = "vol-app-dev-selfserve-service"
        tags                               = {}
      ~ wait_for_steady_state              = false -> true
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 3 to add, 3 to change, 5 to destroy.

```

</details>